JazzJackson0/Embedded-Library/Modules-STM32F446/Drivers-STM32F446/can_STM32F446.h
//STM32F446 Driver
#ifndef CAN_H_
#define CAN_H_

#include <stdint.h>

typedef enum _FilterSize E_FilterSize;
typedef enum _FilterMode E_FilterMode;
typedef struct _Data Received_Data;

void CAN_SetBitTime(uint8_t baudRatePrescale, uint8_t resyncJump, uint8_t timeSeg1, uint8_t timeSeg2);
void CAN_SetAcceptanceFilter(uint8_t filterNum, E_FilterSize filterSize, E_FilterMode filterMode, uint64_t filterBankVal, uint8_t fifoNum);
void CAN_SetTXMailbox(uint8_t canNum, uint64_t standardID, uint8_t numOfBytes);
void CAN_SetRXMailbox(uint8_t canNum, uint64_t standardID, uint8_t numOfBytes);
void CAN_Init_and_Start(uint8_t canNum);
uint8_t CAN_Transmit(uint8_t canNum, uint8_t *dataBuffer, uint8_t numOfBytes);
Received_Data* CAN_Receive(uint8_t canNum, uint8_t numOfBytes);

#define CLOCK 0x40023800
#define APB1 0x40
#define CAN1 0x40006400
#define CAN2 0x40006800
#define CANx CAN1

//CLOCK
#define ADDR_CAN_CLOCK ( (CAN_CLOCK*) ((CLOCK) + APB1) )

//CONTROL & STATUS REGISTERS-----------------------------------------------
#define ADDR_CAN_MASTER_CONTROL ( (CAN_MASTER_CONTROL*) ((CANx) + 0x00) )
#define ADDR_CAN_MASTER_SATUS ( (CAN_MASTER_SATUS*) ((CANx) + 0x04) )
#define ADDR_CAN_TRANSMIT_STATUS ( (CAN_TRANSMIT_STATUS*) ((CANx) + 0x08) )
#define ADDR_CAN_RECEIVE_FIFO0 ( (CAN_RECEIVE_FIFO0*) ((CANx) + 0x0C) )
#define ADDR_CAN_RECEIVE_FIFO1 ( (CAN_RECEIVE_FIFO1*) ((CANx) + 0x10) )
#define ADDR_CAN_INTERRUPTS ( (CAN_INTERRUPTS*) ((CANx) + 0x14) )
#define ADDR_CAN_ERRORSTATUS ( (CAN_ERRORSTATUS*) ((CANx) + 0x18) )
#define ADDR_CAN_BITTIMING ( (CAN_BITTIMING*) ((CANx) + 0x1C) )

//MAILBOX REGISTERS--------------------------------------------------------
//tx
#define ADDR_CAN_TX_MAILBOX_IDENTIFIER_1 ( (CAN_TX_MAILBOX_IDENTIFIER*) ((CANx) + 0x180) )
#define ADDR_CAN_TX_MAILBOX_IDENTIFIER_2 ( (CAN_TX_MAILBOX_IDENTIFIER*) ((CANx) + 0x190) )
#define ADDR_CAN_TX_MAILBOX_IDENTIFIER_3 ( (CAN_TX_MAILBOX_IDENTIFIER*) ((CANx) + 0x1A0) )

#define ADDR_CAN_TX_MAILBOX_DATALENCNTRL_TIMESTAMP_1 ( (CAN_TX_MAILBOX_DATALENCNTRL_TIMESTAMP*) ((CANx) + 0x184) )
#define ADDR_CAN_TX_MAILBOX_DATALENCNTRL_TIMESTAMP_2 ( (CAN_TX_MAILBOX_DATALENCNTRL_TIMESTAMP*) ((CANx) + 0x194) )
#define ADDR_CAN_TX_MAILBOX_DATALENCNTRL_TIMESTAMP_3 ( (CAN_TX_MAILBOX_DATALENCNTRL_TIMESTAMP*) ((CANx) + 0x1A4) )

#define ADDR_CAN_TX_MAILBOX_DATALOW_1 ( (CAN_TX_MAILBOX_DATALOW*) ((CANx) + 0x188) )
#define ADDR_CAN_TX_MAILBOX_DATALOW_2 ( (CAN_TX_MAILBOX_DATALOW*) ((CANx) + 0x198) )
#define ADDR_CAN_TX_MAILBOX_DATALOW_3 ( (CAN_TX_MAILBOX_DATALOW*) ((CANx) + 0x1A8) )

#define ADDR_CAN_TX_MAILBOX_DATAHIGH_1 ( (CAN_TX_MAILBOX_DATAHIGH*) ((CANx) + 0x18C) )
#define ADDR_CAN_TX_MAILBOX_DATAHIGH_2 ( (CAN_TX_MAILBOX_DATAHIGH*) ((CANx) + 0x19C) )
#define ADDR_CAN_TX_MAILBOX_DATAHIGH_3 ( (CAN_TX_MAILBOX_DATAHIGH*) ((CANx) + 0x1AC) )

//rx
#define ADDR_CAN_RX_MAILBOX_IDENTIFIER_1 ( (CAN_RX_MAILBOX_IDENTIFIER*) ((CANx) + 0x1B0) )
#define ADDR_CAN_RX_MAILBOX_IDENTIFIER_2 ( (CAN_RX_MAILBOX_IDENTIFIER*) ((CANx) + 0x1C0) )

#define ADDR_CAN_RX_MAILBOX_DATALENCNTRL_TIMESTAMP_1 ( (CAN_RX_MAILBOX_DATALENCNTRL_TIMESTAMP*) ((CANx) + 0x1B4) )
#define ADDR_CAN_RX_MAILBOX_DATALENCNTRL_TIMESTAMP_2 ( (CAN_RX_MAILBOX_DATALENCNTRL_TIMESTAMP*) ((CANx) + 0x1C4) )

#define ADDR_CAN_RX_MAILBOX_DATALOW_1 ( (CAN_RX_MAILBOX_DATALOW*) ((CANx) + 0x1B8) )
#define ADDR_CAN_RX_MAILBOX_DATALOW_2 ( (CAN_RX_MAILBOX_DATALOW*) ((CANx) + 0x1C8) )

#define ADDR_CAN_RX_MAILBOX_DATAHIGH_1 ( (CAN_RX_MAILBOX_DATAHIGH*) ((CANx) + 0x1BC) )
#define ADDR_CAN_RX_MAILBOX_DATAHIGH_2 ( (CAN_RX_MAILBOX_DATAHIGH*) ((CANx) + 0x1CC) )


//FILTER REGISTERS--------------------------------------------------------
#define ADDR_CAN_FILTER_MASTER ( (CAN_FILTER_MASTER*) ((CANx) + 0x200) )
#define ADDR_CAN_FILTER_MODE ( (CAN_FILTER_MODE*) ((CANx) + 0x204) )
#define ADDR_CAN_FILTER_SCALE ( (CAN_FILTER_SCALE*) ((CANx) + 0x20C) )
#define ADDR_CAN_FILTER_FIFO_ASSIGNMENT ( (CAN_FILTER_FIFO_ASSIGNMENT*) ((CANx) + 0x214) )
#define ADDR_CAN_FILTER_ACTIVATION ( (CAN_FILTER_ACTIVATION*) ((CANx) + 0x21C) )

#define ADDR_CAN_FILTERBANK0_REGISTER1 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x240) )
#define ADDR_CAN_FILTERBANK1_REGISTER1 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x244) )
#define ADDR_CAN_FILTERBANK2_REGISTER1 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x248) )
#define ADDR_CAN_FILTERBANK3_REGISTER1 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x24C) )
#define ADDR_CAN_FILTERBANK4_REGISTER1 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x250) )
#define ADDR_CAN_FILTERBANK5_REGISTER1 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x254) )
#define ADDR_CAN_FILTERBANK6_REGISTER1 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x258) )
#define ADDR_CAN_FILTERBANK7_REGISTER1 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x25C) )
#define ADDR_CAN_FILTERBANK8_REGISTER1 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x260) )
#define ADDR_CAN_FILTERBANK9_REGISTER1 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x264) )
#define ADDR_CAN_FILTERBANK10_REGISTER1 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x268) )
#define ADDR_CAN_FILTERBANK11_REGISTER1 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x26C) )
#define ADDR_CAN_FILTERBANK12_REGISTER1 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x270) )
#define ADDR_CAN_FILTERBANK13_REGISTER1 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x274) )
#define ADDR_CAN_FILTERBANK14_REGISTER1 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x278) )
#define ADDR_CAN_FILTERBANK15_REGISTER1 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x27C) )
#define ADDR_CAN_FILTERBANK16_REGISTER1 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x280) )
#define ADDR_CAN_FILTERBANK17_REGISTER1 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x284) )
#define ADDR_CAN_FILTERBANK18_REGISTER1 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x288) )
#define ADDR_CAN_FILTERBANK19_REGISTER1 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x28C) )
#define ADDR_CAN_FILTERBANK20_REGISTER1 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x290) )
#define ADDR_CAN_FILTERBANK21_REGISTER1 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x294) )
#define ADDR_CAN_FILTERBANK22_REGISTER1 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x298) )
#define ADDR_CAN_FILTERBANK23_REGISTER1 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x29C) )
#define ADDR_CAN_FILTERBANK24_REGISTER1 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x2A0) )
#define ADDR_CAN_FILTERBANK25_REGISTER1 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x2A4) )
#define ADDR_CAN_FILTERBANK26_REGISTER1 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x2A8) )
#define ADDR_CAN_FILTERBANK27_REGISTER1 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x2AC) )

#define ADDR_CAN_FILTERBANK0_REGISTER2 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x2B0) )
#define ADDR_CAN_FILTERBANK1_REGISTER2 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x2B4) )
#define ADDR_CAN_FILTERBANK2_REGISTER2 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x2B8) )
#define ADDR_CAN_FILTERBANK3_REGISTER2 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x2BC) )
#define ADDR_CAN_FILTERBANK4_REGISTER2 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x2C0) )
#define ADDR_CAN_FILTERBANK5_REGISTER2 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x2C4) )
#define ADDR_CAN_FILTERBANK6_REGISTER2 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x2C8) )
#define ADDR_CAN_FILTERBANK7_REGISTER2 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x2CC) )
#define ADDR_CAN_FILTERBANK8_REGISTER2 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x2D0) )
#define ADDR_CAN_FILTERBANK9_REGISTER2 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x2D4) )
#define ADDR_CAN_FILTERBANK10_REGISTER2 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x2D8) )
#define ADDR_CAN_FILTERBANK11_REGISTER2 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x2DC) )
#define ADDR_CAN_FILTERBANK12_REGISTER2 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x2E0) )
#define ADDR_CAN_FILTERBANK13_REGISTER2 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x2E4) )
#define ADDR_CAN_FILTERBANK14_REGISTER2 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x2E8) )
#define ADDR_CAN_FILTERBANK15_REGISTER2 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x2EC) )
#define ADDR_CAN_FILTERBANK16_REGISTER2 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x2F0) )
#define ADDR_CAN_FILTERBANK17_REGISTER2 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x2F4) )
#define ADDR_CAN_FILTERBANK18_REGISTER2 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x2F8) )
#define ADDR_CAN_FILTERBANK19_REGISTER2 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x2FC) )
#define ADDR_CAN_FILTERBANK20_REGISTER2 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x300) )
#define ADDR_CAN_FILTERBANK21_REGISTER2 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x304) )
#define ADDR_CAN_FILTERBANK22_REGISTER2 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x308) )
#define ADDR_CAN_FILTERBANK23_REGISTER2 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x30C) )
#define ADDR_CAN_FILTERBANK24_REGISTER2 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x310) )
#define ADDR_CAN_FILTERBANK25_REGISTER2 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x314) )
#define ADDR_CAN_FILTERBANK26_REGISTER2 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x318) )
#define ADDR_CAN_FILTERBANK27_REGISTER2 ( (CAN_FILTERBANKi_REGISTERx*) ((CANx) + 0x31C) )

//CAN_ERRORSTATUS
/*Most recent error code*/
#define NO_ERROR 0x00
#define STUFF_ERROR 0x01
#define FORM_ERROR 0x02
#define ACK_ERROR 0x03
#define BIT_RECESSIVE_ERROR 0x04
#define BIT_DOMINANT_ERROR 0x05
#define CRC_ERROR 0x06
#define SETBY_SOFTWARE 0x07

//CAN_TX_MAILBOX_DATALENCNTRL_TIMESTAMP
/*Data Length in Bytes*/
#define BYTES_0 0x00
#define BYTES_1 0x01
#define BYTES_2 0x02
#define BYTES_3 0x03
#define BYTES_4 0x04
#define BYTES_5 0x05
#define BYTES_6 0x06
#define BYTES_7 0x07
#define BYTES_8 0x08


//Enums----------------------------------------------------------------------

