JazzJackson0/Embedded-Library/Modules-STM32F446/Drivers-STM32F446/can_STM32F446.h
//CAN_FILTER_SCALE
enum _FilterSize {
	_16BIT_CAN = 0,
	_32BIT_CAN = 1
};

//CAN_FILTER_MODE
enum _FilterMode {
	MASK_MODE = 0,
	LIST_MODE = 1
};

//Struct for holding received bytes------------------------------------------
struct _Data {
	uint8_t byte0;
	uint8_t byte1;
	uint8_t byte2;
	uint8_t byte3;
	uint8_t byte4;
	uint8_t byte5;
	uint8_t byte6;
	uint8_t byte7;
};

//Clock Register-------------------------------------------------------------
typedef struct {
	const uint32_t reserved0:25;
	volatile uint32_t can1_StartTick:1;
	volatile uint32_t can2_StartTick:1;
	const uint32_t reserved1:5;
}CAN_CLOCK;


//CONTROL & STATUS REGISTERS-----------------------------------------------
typedef struct {
	volatile uint32_t send_InitializeModeRequest:1;
	volatile uint32_t send_SleepModeRequest:1;
	volatile uint32_t txOrderIdentifier0_txOrderChronological1:1;
	volatile uint32_t enable_LockRXWhenFull:1;
	volatile uint32_t disable_AutoRetransmit:1;
	volatile uint32_t enable_AutoWakeUp:1;
	volatile uint32_t enable_AutoExitBusOffState:1;
	volatile uint32_t enable_TimeTriggeredCommMode:1;
	const uint32_t reserved0:7;
	volatile uint32_t resetMaster_thenSleep:1;
	volatile uint32_t enable_FreezeDuringDebug:1;
	const uint32_t reserved:15;
}CAN_MASTER_CONTROL;

typedef struct {
	volatile uint32_t initializeModeRequestAccepted:1;
	volatile uint32_t sleepModeRequestAccepted:1;
	volatile uint32_t errorDetected:1;
	volatile uint32_t wakeUpDetected:1;
	volatile uint32_t inSleepMode:1;
	const uint32_t reserved0:3;
	volatile uint32_t inTransmitMode:1;
	volatile uint32_t inReceiveMode:1;
	volatile uint32_t rxVal_LastSamplePoint:1;
	volatile uint32_t rxSignal:1;
	const uint32_t reserved:20;
}CAN_MASTER_SATUS;

typedef struct {
	volatile uint32_t mailbox0_RequestCompleted:1;
	volatile uint32_t mailbox0_TransmitSuccess:1;
	volatile uint32_t mailbox0_ArbitrationLost:1;
	volatile uint32_t mailbox0_TransmitError:1;
	const uint32_t reserved0:3;
	volatile uint32_t send_Mailbox0TransmitAbortRequest:1;
	volatile uint32_t mailbox1_RequestCompleted:1;
	volatile uint32_t mailbox1_TransmitSuccess:1;
	volatile uint32_t mailbox1_ArbitrationLost:1;
	volatile uint32_t mailbox1_TransmitError:1;
	const uint32_t reserved1:3;
	volatile uint32_t send_Mailbox1TransmitAbortRequest:1;
	volatile uint32_t mailbox2_RequestCompleted:1;
	volatile uint32_t mailbox2_TransmitSuccess:1;
	volatile uint32_t mailbox2_ArbitrationLost:1;
	volatile uint32_t mailbox2_TransmitError:1;
	const uint32_t reserved2:3;
	volatile uint32_t send_Mailbox2TransmitAbortRequest:1;
	volatile uint32_t freeMailbox:2;
	volatile uint32_t mailbox0_NoTransmitRequestPending:1;
	volatile uint32_t mailbox1_NoTransmitRequestPending:1;
	volatile uint32_t mailbox2_NoTransmitRequestPending:1;
	volatile uint32_t mailbox0_HasLowestPriority:1;
	volatile uint32_t mailbox1_HasLowestPriority:1;
	volatile uint32_t mailbox2_HasLowestPriority:1;
}CAN_TRANSMIT_STATUS;

typedef struct {
	volatile uint32_t numOfMessagesWaitingInFIFO0:2;
	const uint32_t reserved0:1;
	volatile uint32_t messageFIFO0_Full:1;
	volatile uint32_t messageFIFO0_Overrun:1;
	volatile uint32_t release_FIFO0_OutputMailbox:1;
	const uint32_t reserved1:26;
}CAN_RECEIVE_FIFO0;

typedef struct {
	volatile uint32_t numOfMessagesWaitingInFIFO1:2;
	const uint32_t reserved0:1;
	volatile uint32_t messageFIFO1_Full:1;
	volatile uint32_t messageFIFO1_Overrun:1;
	volatile uint32_t release_FIFO1_OutputMailbox:1;
	const uint32_t reserved1:26;
}CAN_RECEIVE_FIFO1;

typedef struct {
	volatile uint32_t enable_TransmitMailboxEmptyInterrupt:1;
	volatile uint32_t enable_FIFO0MessagePendingInterrupt:1;
	volatile uint32_t enable_FIFO0FullInterrupt:1;
	volatile uint32_t enable_FIFO0OverrunInterrupt:1;
	volatile uint32_t enable_FIFO1MessagePendingInterrupt:1;
	volatile uint32_t enable_FIFO1FullInterrupt:1;
	volatile uint32_t enable_FIFO1OverrunInterrupt:1;
	const uint32_t reserved0:1;
	volatile uint32_t enable_ErrorWarningInterrupt:1;
	volatile uint32_t enable_ErrorPassiveInterrupt:1;
	volatile uint32_t enable_BusOffInterrupt:1;
	volatile uint32_t enable_LastErrorCodeInterrupt:1;
	const uint32_t reserved1:3;
	volatile uint32_t enable_ErrorInterrupt:1;
	volatile uint32_t enable_WakeupInterrupt:1;
	volatile uint32_t enable_SleepInterrupt:1;
	const uint32_t reserved2:14;
}CAN_INTERRUPTS;

typedef struct {
	volatile uint32_t errorWarning:1;
	volatile uint32_t ErrorPassive:1;
	volatile uint32_t busOff:1;
	const uint32_t reserved0:1;
	volatile uint32_t mostRecentErrorCode:3;
	const uint32_t reserved1:9;
	volatile uint32_t numOfTransmitErrors:8;
	volatile uint32_t numOfReceiveErrors:8;
}CAN_ERRORSTATUS;

typedef struct {
	volatile uint32_t rw_BaudRatePrescaler:10;
	const uint32_t reserved0:6;
	volatile uint32_t rw_TimeSegment1:4; //No Macros available
	volatile uint32_t rw_TimeSegment2:3; //No Macros available
	const uint32_t reserved1:1;
	volatile uint32_t rw_ReSyncJumpWidth:2; //No Macros available
	const uint32_t reserved2:4;
	volatile uint32_t enable_LoopbackMode:1;
	volatile uint32_t enable_SilentMode:1;
}CAN_BITTIMING;


//MAILBOX REGISTERS-------------------------------------------------------
typedef union {
	
	struct {
		volatile uint32_t request_TransmissionFromMailbox:1;
		volatile uint32_t enable_RemoteFrame:1;
		volatile uint32_t enable_ExtendedIdentifier:1;
		volatile uint32_t rw_ExtendedIdentifier:26;
		const uint32_t reserved:3;
	}ExtendedIdentifier;

	struct {
		volatile uint32_t request_TransmissionFromMailbox:1;
		volatile uint32_t enable_RemoteFrame:1;
		const uint32_t reserved:19;
		volatile uint32_t rw_StandardIdentifier:11;
	}StandardIdentifier;

}CAN_TX_MAILBOX_IDENTIFIER;

typedef struct {
	volatile uint32_t rw_DataLen_InBytes:4;
	const uint32_t reserved:12;
	volatile uint32_t rw_MessageTimeStamp:16;
}CAN_TX_MAILBOX_DATALENCNTRL_TIMESTAMP;

typedef struct {
	volatile uint32_t rw_DataByte0:8;
	volatile uint32_t rw_DataByte1:8;
	volatile uint32_t rw_DataByte2:8;
	volatile uint32_t rw_DataByte3:8;
}CAN_TX_MAILBOX_DATALOW;

typedef struct {
	volatile uint32_t rw_DataByte4:8;
	volatile uint32_t rw_DataByte5:8;
	volatile uint32_t rw_DataByte6:8;
	volatile uint32_t rw_DataByte7:8;

}CAN_TX_MAILBOX_DATAHIGH;

