JazzJackson0/Embedded-Library/Modules-STM32F446/Drivers-STM32F446/can_STM32F446.h
typedef struct {
	struct {
		const uint32_t reserved0:1;
		volatile uint32_t enable_RemoteFrame:1;
		volatile uint32_t enable_ExtendedIdentifier:1;
		volatile uint32_t read_ExtendedIdentifier:26;
		const uint32_t reserved1:3;
	}ExtendedIdentifier;

	struct {
		const uint32_t reserved0:1;
		volatile uint32_t enable_RemoteFrame:1;
		const uint32_t reserved1:19;
		volatile uint32_t read_StandardIdentifier:11;
	}StandardIdentifier;
}CAN_RX_MAILBOX_IDENTIFIER;

typedef struct {
	volatile uint32_t read_DataLen_InBytes:4;
	const uint32_t reserved0:4;
	volatile uint32_t read_IdentifierFilterMatchIndex:8;
	volatile uint32_t read_MessageTimeStamp:16;
}CAN_RX_MAILBOX_DATALENCNTRL_TIMESTAMP;

typedef struct {
	volatile uint32_t read_DataByte0:8;
	volatile uint32_t read_DataByte1:8;
	volatile uint32_t read_DataByte2:8;
	volatile uint32_t read_DataByte3:8;
}CAN_RX_MAILBOX_DATALOW;

typedef struct {
	volatile uint32_t read_DataByte4:8;
	volatile uint32_t read_DataByte5:8;
	volatile uint32_t read_DataByte6:8;
	volatile uint32_t read_DataByte7:8;
}CAN_RX_MAILBOX_DATAHIGH;



//FILTER REGISTERS--------------------------------------------------------
typedef struct {
	volatile uint32_t filterActive0_filterReadyToInitialize1:1;
	const uint32_t reserved0:7;
	volatile uint32_t set_CAN2StartBank:6;
	const uint32_t reserved1:18;
}CAN_FILTER_MASTER;

typedef struct {
	volatile uint32_t filter0IDMaskMode0_filter0IDListMode1:1;
	volatile uint32_t filter1IDMaskMode0_filter1IDListMode1:1;
	volatile uint32_t filter2IDMaskMode0_filter2IDListMode1:1;
	volatile uint32_t filter3IDMaskMode0_filter3IDListMode1:1;
	volatile uint32_t filter4IDMaskMode0_filter4IDListMode1:1;
	volatile uint32_t filter5IDMaskMode0_filter5IDListMode1:1;
	volatile uint32_t filter6IDMaskMode0_filter6IDListMode1:1;
	volatile uint32_t filter7IDMaskMode0_filter7IDListMode1:1;
	volatile uint32_t filter8IDMaskMode0_filter8IDListMode1:1;
	volatile uint32_t filter9IDMaskMode0_filter9IDListMode1:1;
	volatile uint32_t filter10IDMaskMode0_filter10IDListMode1:1;
	volatile uint32_t filter11IDMaskMode0_filter11IDListMode1:1;
	volatile uint32_t filter12IDMaskMode0_filter12IDListMode1:1;
	volatile uint32_t filter13IDMaskMode0_filter13IDListMode1:1;
	volatile uint32_t filter14IDMaskMode0_filter14IDListMode1:1;
	volatile uint32_t filter15IDMaskMode0_filter15IDListMode1:1;
	volatile uint32_t filter16IDMaskMode0_filter16IDListMode1:1;
	volatile uint32_t filter17IDMaskMode0_filter17IDListMode1:1;
	volatile uint32_t filter18IDMaskMode0_filter18IDListMode1:1;
	volatile uint32_t filter19IDMaskMode0_filter19IDListMode1:1;
	volatile uint32_t filter20IDMaskMode0_filter20IDListMode1:1;
	volatile uint32_t filter21IDMaskMode0_filter21IDListMode1:1;
	volatile uint32_t filter22IDMaskMode0_filter22IDListMode1:1;
	volatile uint32_t filter23IDMaskMode0_filter23IDListMode1:1;
	volatile uint32_t filter24IDMaskMode0_filter24IDListMode1:1;
	volatile uint32_t filter25IDMaskMode0_filter25IDListMode1:1;
	volatile uint32_t filter26IDMaskMode0_filter26IDListMode1:1;
	volatile uint32_t filter27IDMaskMode0_filter27IDListMode1:1;
	const uint32_t reserved:4;
}CAN_FILTER_MODE;

typedef struct {
	volatile uint32_t filter0Size16B0_filter0Size32B1:1;
	volatile uint32_t filter1Size16B0_filter1Size32B1:1;
	volatile uint32_t filter2Size16B0_filter2Size32B1:1;
	volatile uint32_t filter3Size16B0_filter3Size32B1:1;
	volatile uint32_t filter4Size16B0_filter4Size32B1:1;
	volatile uint32_t filter5Size16B0_filter5Size32B1:1;
	volatile uint32_t filter6Size16B0_filter6Size32B1:1;
	volatile uint32_t filter7Size16B0_filter7Size32B1:1;
	volatile uint32_t filter8Size16B0_filter8Size32B1:1;
	volatile uint32_t filter9Size16B0_filter9Size32B1:1;
	volatile uint32_t filter10Size16B0_filter10Size32B1:1;
	volatile uint32_t filter11Size16B0_filter11Size32B1:1;
	volatile uint32_t filter12Size16B0_filter12Size32B1:1;
	volatile uint32_t filter13Size16B0_filter13Size32B1:1;
	volatile uint32_t filter14Size16B0_filter14Size32B1:1;
	volatile uint32_t filter15Size16B0_filter15Size32B1:1;
	volatile uint32_t filter16Size16B0_filter16Size32B1:1;
	volatile uint32_t filter17Size16B0_filter17Size32B1:1;
	volatile uint32_t filter18Size16B0_filter18Size32B1:1;
	volatile uint32_t filter19Size16B0_filter19Size32B1:1;
	volatile uint32_t filter20Size16B0_filter20Size32B1:1;
	volatile uint32_t filter21Size16B0_filter21Size32B1:1;
	volatile uint32_t filter22Size16B0_filter22Size32B1:1;
	volatile uint32_t filter23Size16B0_filter23Size32B1:1;
	volatile uint32_t filter24Size16B0_filter24Size32B1:1;
	volatile uint32_t filter25Size16B0_filter25Size32B1:1;
	volatile uint32_t filter26Size16B0_filter26Size32B1:1;
	volatile uint32_t filter27Size16B0_filter27Size32B1:1;
	const uint32_t reserved:4;
}CAN_FILTER_SCALE;

typedef struct {
	volatile uint32_t filter0ToFIFO0_filter0ToFIFO1:1;
	volatile uint32_t filter1ToFIFO0_filter1ToFIFO1:1;
	volatile uint32_t filter2ToFIFO0_filter2ToFIFO1:1;
	volatile uint32_t filter3ToFIFO0_filter3ToFIFO1:1;
	volatile uint32_t filter4ToFIFO0_filter4ToFIFO1:1;
	volatile uint32_t filter5ToFIFO0_filter5ToFIFO1:1;
	volatile uint32_t filter6ToFIFO0_filter6ToFIFO1:1;
	volatile uint32_t filter7ToFIFO0_filter7ToFIFO1:1;
	volatile uint32_t filter8ToFIFO0_filter8ToFIFO1:1;
	volatile uint32_t filter9ToFIFO0_filter9ToFIFO1:1;
	volatile uint32_t filter10ToFIFO0_filter10ToFIFO1:1;
	volatile uint32_t filter11ToFIFO0_filter11ToFIFO1:1;
	volatile uint32_t filter12ToFIFO0_filter12ToFIFO1:1;
	volatile uint32_t filter13ToFIFO0_filter13ToFIFO1:1;
	volatile uint32_t filter14ToFIFO0_filter14ToFIFO1:1;
	volatile uint32_t filter15ToFIFO0_filter15ToFIFO1:1;
	volatile uint32_t filter16ToFIFO0_filter16ToFIFO1:1;
	volatile uint32_t filter17ToFIFO0_filter17ToFIFO1:1;
	volatile uint32_t filter18ToFIFO0_filter18ToFIFO1:1;
	volatile uint32_t filter19ToFIFO0_filter19ToFIFO1:1;
	volatile uint32_t filter20ToFIFO0_filter20ToFIFO1:1;
	volatile uint32_t filter21ToFIFO0_filter21ToFIFO1:1;
	volatile uint32_t filter22ToFIFO0_filter22ToFIFO1:1;
	volatile uint32_t filter23ToFIFO0_filter23ToFIFO1:1;
	volatile uint32_t filter24ToFIFO0_filter24ToFIFO1:1;
	volatile uint32_t filter25ToFIFO0_filter25ToFIFO1:1;
	volatile uint32_t filter26ToFIFO0_filter26ToFIFO1:1;
	volatile uint32_t filter27ToFIFO0_filter27ToFIFO1:1;
	const uint32_t reserved:4;
}CAN_FILTER_FIFO_ASSIGNMENT;

