JazzJackson0/Embedded-Library/Modules-STM32F446/Drivers-STM32F446/can_STM32F446.h
typedef struct {
	volatile uint32_t enable_Filter0:1;
	volatile uint32_t enable_Filter1:1;
	volatile uint32_t enable_Filter2:1;
	volatile uint32_t enable_Filter3:1;
	volatile uint32_t enable_Filter4:1;
	volatile uint32_t enable_Filter5:1;
	volatile uint32_t enable_Filter6:1;
	volatile uint32_t enable_Filter7:1;
	volatile uint32_t enable_Filter8:1;
	volatile uint32_t enable_Filter9:1;
	volatile uint32_t enable_Filter10:1;
	volatile uint32_t enable_Filter11:1;
	volatile uint32_t enable_Filter12:1;
	volatile uint32_t enable_Filter13:1;
	volatile uint32_t enable_Filter14:1;
	volatile uint32_t enable_Filter15:1;
	volatile uint32_t enable_Filter16:1;
	volatile uint32_t enable_Filter17:1;
	volatile uint32_t enable_Filter18:1;
	volatile uint32_t enable_Filter19:1;
	volatile uint32_t enable_Filter20:1;
	volatile uint32_t enable_Filter21:1;
	volatile uint32_t enable_Filter22:1;
	volatile uint32_t enable_Filter23:1;
	volatile uint32_t enable_Filter24:1;
	volatile uint32_t enable_Filter25:1;
	volatile uint32_t enable_Filter26:1;
	volatile uint32_t enable_Filter27:1;
	const uint32_t reserved:4;
}CAN_FILTER_ACTIVATION;

typedef struct {
	volatile uint32_t bit0_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit1_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit2_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit3_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit4_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit5_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit6_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit7_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit8_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit9_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit10_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit11_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit12_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit13_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit14_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit15_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit16_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit17_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit18_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit19_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit20_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit21_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit22_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit23_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit24_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit25_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit26_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit27_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit28_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit29_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit30_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit31_Expects0_Expects1OrMatch1:1;
	volatile uint32_t bit32_Expects0_Expects1OrMatch1:1;
}CAN_FILTERBANKi_REGISTERx;


#endif
